html/2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-19 Wed 16:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>简单的新命令</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shuai Zhao" />
<link rel="stylesheet" type="text/css" href="../resource/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">简单的新命令</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org192929b">1. 在本章：</a></li>
<li><a href="#org39227f3">2. 游历窗口</a>
<ul>
<li><a href="#org57813f6">2.1. 定义other-window-backward</a></li>
<li><a href="#orgaa44fcc">2.2. 为other-window-backward添加参数</a></li>
<li><a href="#org9810a0b">2.3. 可选参数</a></li>
<li><a href="#orgc956d88">2.4. 简化代码</a></li>
<li><a href="#org9a77f85">2.5. 逻辑表达式</a></li>
<li><a href="#orgd986a50">2.6. 最好的other-window-backward</a></li>
</ul>
</li>
<li><a href="#org722028f">3. 逐行滚动</a></li>
<li><a href="#org938285e">4. 其他光标和文本移动命令</a></li>
<li><a href="#org84255aa">5. 处理符号链接</a>
<ul>
<li><a href="#org5f6e245">5.1. 钩子</a></li>
<li><a href="#org387c131">5.2. 匿名函数</a></li>
<li><a href="#org61658d5">5.3. 处理符号链接</a></li>
</ul>
</li>
<li><a href="#org2ec2b55">6. 修饰Buffer切换</a></li>
<li><a href="#orga5f98e8">7. 补充：原始的前置参数</a></li>
</ul>
</div>
</div>

<div id="outline-container-org192929b" class="outline-2">
<h2 id="org192929b"><span class="section-number-2">1</span> 在本章：</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>游历窗口</b><br />
<b>逐行滚动</b><br />
<b>其他光标和文本移动命令</b><br />
<b>处理符号链接</b><br />
<b>修饰Buffer切换</b><br />
<b>补充：原始的前置参数</b><br />
</p>

<p>
本章中我们将会着手写一些很小的Lisp函数和命令，介绍很多的概念来帮助我们面对后面章节中将出现的更大的任务。<br />
</p>
</div>
</div>

<div id="outline-container-org39227f3" class="outline-2">
<h2 id="org39227f3"><span class="section-number-2">2</span> 游历窗口</h2>
<div class="outline-text-2" id="text-2">
<p>
当我最初使用Emacs时，我对于C-x o很满意，也就是other-window。它将光标从一个窗口移动到另一个。如果我想把光标移动回前一个，我必须使用-1作为参数执行other-window，这需要输入C-u -1 C-x o，这太繁琐了。而同样繁琐的另一种方案是不停C-x o直到我逛遍所有窗口最终回到前一个窗口。<br />
</p>

<p>
我真正需要的是用一个按键绑定表示“下一个窗口”以及另一个表示“前一个窗口”。我知道我可以编写一些Emacs Lisp代码将我需要的方法绑定到新的按键上。首先我必须选择这些按键。“Next”和“Previous”自然可以想到C-n和C-p，但是这些已经被绑定到了next-line和previous-line而我并不想修改它们。另一个选择是使用一些前置按键，后面跟着C-n和C-p。Emacs已经使用C-x作为很多两键命令的前置键（就像C-x o自己），所以我选择C-x C-n对应“下一个窗口”而C-x C-p对应“前一个窗口”。<br />
</p>

<p>
我使用帮助命令describe-key[<a href="#org80c40bc">8</a>]来查看C-x C-n和C-x C-p是否已经绑定到其他按键了。我发现C-x C-p已经绑定到了set-goal-column，而C-x C-p绑定到了mark-page。将他们绑定到“下一个窗口”和“上一个窗口”将会覆盖他们默认的绑定。而因为这并不是我经常使用的命令，所以我并不介意覆盖他们。如果我需要的话可以使用M-x来触发他们。<br />
</p>

<p>
在决定了使用C-x C-n表示“下一个窗口”之后，我需要将它绑定到一些触发“下一个窗口”的命令上。而下一个窗口实际上和C-x o所执行的跳到另一个窗口的行为一样，也就是other-window。所以C-x C-n的按键绑定很简单。将下面的命令<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>global-set-key <span style="color: #98be65;">"\C-x\C-n"</span> 'other-window<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
写入到.emacs中就完成了。而定义C-x C-p绑定的命令就要动一点脑子了。Emacs中并不存在一个命令表示“将光标移动到上一个窗口”。是时候定义一个了！<br />
</p>
</div>

<div id="outline-container-org57813f6" class="outline-3">
<h3 id="org57813f6"><span class="section-number-3">2.1</span> 定义other-window-backward</h3>
<div class="outline-text-3" id="text-2-1">
<p>
既然知道了给other-window传递一个参数-1可以使光标移动到上一个窗口，那么我们可以定义一个新的命令other-window-backward，如下所示：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">other-window-backward</span> <span style="color: #c678dd;">()</span>
  <span style="color: #83898d;">"Select the previous window."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>other-window -1<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
让我们看一下这个函数定义的各个部分。<br />
</p>
<ol class="org-ol">
<li>Lisp函数的定义以defun开始。<br /></li>
<li>下面跟着要定义的函数名称；这里使用other-window-backward。<br /></li>
<li>下面跟着函数的参数列表[<a href="#org4fe4ba0">9</a>]。这个函数没有参数，所以我们使用了一个空列表。<br /></li>
<li>字符串”Select the previous window.”是这个新函数的文档字符串，或者叫做docstring。任何Lisp函数定义都可以有一个文档字符串。Emacs将会在使用命令describe-function(M-? f)或者apropos展示在线帮助时显示这个字符串。<br /></li>
<li>下一行(interactive)很特殊。这表示这个函数是一个交互式命令。在Emacs里，命令表示一个可以交互执行的Lisp函数，这表示它可以通过按键绑定或者通过M-x command-name来进行触发。并不是所有Lisp函数都是命令，但所有命令都是Lisp函数。<br />
任何Lisp函数，包括交互命令，可以被其他Lisp代码使用(function arg &#x2026;)语法来进行调用。<br />
函数通过在函数定义的头部（在可选的docstring之后）使用特殊的(interactive)表达式来表示自己是交互命令。更多信息在之后的“交互声明”中做更多叙述。<br /></li>

<li>跟在函数名，参数列表，文档字符串，以及interactive声明之后的是函数体，也就是一个Lisp表达式序列。这个函数的函数体是一个单独的表达式(other-window -1)，也就是使用参数-1调用函数other-window。<br /></li>
</ol>

<p>
执行defun表达式用来定义函数。现在我们可以在Lisp程序中通过(other-window-backward)来调用它；或者通过输入M-x other-window-backward RET来调用它；也可以通过M-? f other-window-backward RET[<a href="#org8bc2a19">10</a>]来查看帮助。现在我们唯一需要做的就是绑定：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>global-set-key <span style="color: #98be65;">"\C-x\C-p"</span> 'other-window-backward<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa44fcc" class="outline-3">
<h3 id="orgaa44fcc"><span class="section-number-3">2.2</span> 为other-window-backward添加参数</h3>
<div class="outline-text-3" id="text-2-2">
<p>
这个按键绑定已经能满足我们的需求了，但是我们还需要进行一点点改进。当使用C-x o（或者我们现在可以使用C-x C-n）来调用other-window时，你可以使用一个数字n作为参数来改变它的行为。如果使用了n，other-window可以跳过很多窗口。例如，C-u 2 C-x C-n表示“移动到当前窗口后面的第二个窗口”。就像我们已经看到的，n可以是一个负数来向回跳n个窗口。因此给other-window-backward添加一个参数来跳过窗口是很自然的想法。而现在，other-window-backward只能每次向后跳一次。<br />
</p>

<p>
因此，我们需要给这个函数一个参数：要跳过的窗口数。我们可以这么做：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">other-window-backward</span> <span style="color: #c678dd;">(</span>n<span style="color: #c678dd;">)</span>
  <span style="color: #83898d;">"Select Nth previous window."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span> <span style="color: #98be65;">"p"</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>other-window <span style="color: #98be65;">(</span>- n<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
我们给自己的函数一个参数n。我们还把交互声明修改为(interactive "p")，还把传递给other-window的参数从-1改为(- n)。让我们从交互声明开始看一下这些改动。<br />
</p>

<p>
就像我们所看到的，交互命令是一种Lisp函数。这意味着命令也可以有参数。从Lisp中向函数传递参数是简单的；只要函数调用时写下来就可以了，就像(other-window -1)。但是如果函数是通过交互命令触发的呢？参数怎么传递？这也就是交互声明的目的。<br />
</p>

<p>
interactive的参数描述了这个函数如何获取参数。当命令不需要参数时，那么interactive也没有参数，就像我们一开始other-window-backward中所示的那样。当命令需要参数时，interactive也有了一个参数：一个字母构成的字符串，每个字母描述一个参数。例子中的字母p表示“如果有前置参数，将它解释为一个数字，如果没有前置参数，就将参数默认设为1。”[<a href="#orgbb880af">11</a>]在命令触发时参数n将接收这个值。所以如果用户输入C-u 7 C-x C-p，n就是7 。如果输入C-x C-p，则n是1 。当然你也可以在Lisp代码中调用other-window-backward，例如(other-window-backward 4)。<br />
</p>

<p>
新版本的other-window-backward使用参数(- n)来调用other-window。这里将n传递给函数-来得到相反数（注意-和n之间的空格）。-通常表示减&#x2013;例如(- 5 2)得到3&#x2013;但是当只有一个参数时，他表示取负。<br />
</p>

<p>
默认情况下，n是1，(- n)就是-1，对于other-window的调用就变成了(other-window -1)&#x2013;同函数的第一个版本一样。如果用户指定了一个数字前缀参数&#x2013;例如C-u 3 C-x C-p&#x2013;那么我们调用的就是(other-window -3)，也就是向前移动3个窗口，这正是我们需要的。<br />
</p>

<p>
理解(- n)和-1的区别很重要。前者是一个函数调用。函数名和参数之间必须有一个空格。后者是一个整数常量。负号和1之间并没有空格。当然你也可以将它写成(- 1)（虽然没有必要在能直接写成-1的情况下而触发一次函数调用）。不能写成-n，因为n不是一个常量。<br />
</p>
</div>
</div>
