2.org
** 可选参数
我们还可以对other-window-backward做出另一个改进，即当调用函数的时候参数n是可选的，也就是当交互触发的时候前置参数也是可选的。它应该能够在不提供参数（other-window-backward）时触发默认行为（即(other-window-backward 1)）。就像这样实现：

#+BEGIN_SRC emacs-lisp
  (defun other-window-backward (&optional n)
    "Select Nth previous window."
    (interactive "p")
    (if n
        (other-window (- n))              ; 如果n非空
      (other-window -1)))                 ; 如果n为空
#+END_SRC

参数中的关键词&optional表示所有后续的参数都是可选的。可选参数可能会也可能不会传递给函数。如果没给，可选参数的值为nil。

关于符号nil有三点需要注意：
1. 它表示错误。在Lisp的判断结构中--if, cond, while, and, or以及not--nil表示“false”，其他值表示“true”。因此，在表达式  
   #+BEGIN_SRC elisp
     (if n
         (other-window (- n))
       (other-window -1)) 
   #+END_SRC
   
    (Lisp版本的if-then-else结构)中，第一个n被求值。如果n的值是true（非空），那么
    #+BEGIN_SRC elisp
      (other-window (- n))
    #+END_SRC

    被执行，否则
    #+BEGIN_SRC elisp
    (other-window -1)
    #+END_SRC

    被执行。

    还有另一个符号，t，代表truth， 但是这没有nil重要，就像后面表明的。
2. 它和空表很难区分。在Lisp解释器中，符号nil和空表()是相同的对象。如果你调用listp来判断符号nil是否是一个表，你将会得到结果t，也就是truth。同样的，如果你使用symbolp来判断空表是否是一个符号，那么也会得到t。但是，如果你传递任何其他列表给symbolp，或者传递其他符号给listp，那么你会得到nil--即表示非。
3. 它的值就是它自身。当你计算符号nil时，结果是nil。因此，不像其他的符号，当你需要它的名称而不是它的值得时候，nil不需要引用，因为它的名称就是它的值。所以你可以这样写：
    #+BEGIN_SRC emacs-lisp
      (setq x nil) ; 将nil赋给变量x
    #+END_SRC

    将nil赋给变量x而不必这样写：
    #+BEGIN_SRC emacs-lisp
      (setq x 'nil)
    #+END_SRC

    虽然这两种写法都可以。同样的，不要试图将任何新的值赋给nil，[[[2-12][12]]]虽然它看起来是一个合法的变量名称。

nil的另一个功能就是区分列表是否正确。这将在[[file:./6.org][第六章]]中讨论。

另一个符号t用来表示正确。就像nil，t也表示着自身的值，因此不需要引用。与nil不同的是，t并没有跟其他什么对象相同。也与nil不同的是，nil是唯一表示错误的方式，而其他所有Lisp值都和t一样表示正确。但是，当你仅仅想表示正确时（就像symbolp的返回值）你不需要选择一个类似17或者“plugin”这样的值来表示它。

** 简化代码
就像前面提到的，表达式
#+BEGIN_SRC elisp
  (if n                                   ; 如果...
      (other-window (- n))                ; ...那么
    (other-window -1))                    ; ...否则
#+END_SRC

是Lisp版本的if-then-else结构。if的第一个参数是一个条件。它将被检测结果是真（除nil之外的一切值）还是假（nil）。如果为真，则第二个参数--“then”分句将会被执行。如果是假，第三个参数--“else”分句（可选的）--将会被执行。if的返回值总是最后执行的表达式的结果。[[file:./B.org][附录B]]会向你展示if和其他像cond和while这样的Lisp流程控制函数。

在本例中，我们可以通过提取公有表达式的方式来进行简化。注意到other-window在if的两个分支中都被调用了。唯一的区别来自传递给other-window的参数n。因此我们可以将表达式重写：

#+BEGIN_SRC elisp
  (other-window (if n (- n) -1))
#+END_SRC

通常，
#+BEGIN_SRC elisp
  (if test
      (a b)
    (a c))
#+END_SRC

可以简写成(a (if test b c))。

我们还观察到在if的两个分支上，我们都在取反--不管是n的负数还是1的负数。所以

#+BEGIN_SRC elisp
  (if n (-n) -1)
#+END_SRC

可以变为
#+BEGIN_SRC emacs-lisp
  (- (if n n 1))
#+END_SRC

** 逻辑表达式
另一个Lisp程序员的常用技巧甚至可以使这个表达式更简单：
#+BEGIN_SRC elisp
  (if n n 1) = (or n 1)
#+END_SRC

函数or跟大多数语言中的逻辑或都一样：如果所有条件为否，则返回否，否则返回是。但是Lisp的or还有另一个用途：它挨个计算它的参数的值直到找到第一个为真的值并返回。如果没找到，则返回nil。所以or的返回值并不仅仅是false或者true，它返回false或者表中的第一个为true的值。这意味着通常来说，

#+BEGIN_SRC elisp
  (if a a b)
#+END_SRC

可以替换为
#+BEGIN_SRC elisp
  (or a b)
#+END_SRC

实际上，通常我们都应该这么写，因为如果a是true，那么(if a a b)会执行两次a而(or a b)只执行一次。（另一方面，如果你就是想a执行两次，那么当然你应该使用if）。实际上，

#+BEGIN_SRC elisp
  (if a a ; 如果a为true，返回a
    (if b b ; else if b为true，返回b
      ...
      (if y y z))) ; else if y为true，返回y，否则z
#+END_SRC

（虽然这看上去很夸张但在真正的程序里这是很常见的一种模式）可以转换成下面这种形式。

#+BEGIN_SRC elisp
  (or a b .. y z)
#+END_SRC

同样的，
#+BEGIN_SRC elisp
  (if a
      (if b
          ...
        (if y z)))
#+END_SRC

（注意这个例子中没有任何else）可以被写成
#+BEGIN_SRC elisp
  (and a b ... y z)
#+END_SRC

因为and通过计算每个参数直到遇到一个值为nil的参数。如果找到了，就返回nil，否则它返回最后一个参数的值。

另一个简写需要注意：一些程序员喜欢将

#+BEGIN_SRC elisp
(if (and a b ... y) z)
#+END_SRC

转换成
#+BEGIN_SRC elisp
(and a b ... y z)
#+END_SRC

我不这么做，因为虽然他们功能上相同，但是前一个有一个细微的暗示--即“如果a-y都是true的话就执行z”--后一种却不是这样，这可以让人更加容易理解代码。

