html/2.html

<div id="outline-container-org9810a0b" class="outline-3">
<h3 id="org9810a0b"><span class="section-number-3">2.3</span> 可选参数</h3>
<div class="outline-text-3" id="text-2-3">
<p>
我们还可以对other-window-backward做出另一个改进，即当调用函数的时候参数n是可选的，也就是当交互触发的时候前置参数也是可选的。它应该能够在不提供参数（other-window-backward）时触发默认行为（即(other-window-backward 1)）。就像这样实现：<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">other-window-backward</span> <span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">&amp;optional</span> n<span style="color: #c678dd;">)</span>
  <span style="color: #83898d;">"Select Nth previous window."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span> <span style="color: #98be65;">"p"</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> n
      <span style="color: #98be65;">(</span>other-window <span style="color: #da8548;">(</span>- n<span style="color: #da8548;">)</span><span style="color: #98be65;">)</span>              <span style="color: #5B6268;">; </span><span style="color: #5B6268;">&#22914;&#26524;n&#38750;&#31354;</span>
    <span style="color: #98be65;">(</span>other-window -1<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>                 <span style="color: #5B6268;">; </span><span style="color: #5B6268;">&#22914;&#26524;n&#20026;&#31354;</span>
</pre>
</div>

<p>
参数中的关键词&amp;optional表示所有后续的参数都是可选的。可选参数可能会也可能不会传递给函数。如果没给，可选参数的值为nil。<br />
</p>

<p>
关于符号nil有三点需要注意：<br />
</p>
<ol class="org-ol">
<li><p>
它表示错误。在Lisp的判断结构中&#x2013;if, cond, while, and, or以及not&#x2013;nil表示“false”，其他值表示“true”。因此，在表达式  <br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> n
    <span style="color: #c678dd;">(</span>other-window <span style="color: #98be65;">(</span>- n<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>other-window -1<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #ECBE7B;">&#8232;</span>
</pre>
</div>

<p>
(Lisp版本的if-then-else结构)中，第一个n被求值。如果n的值是true（非空），那么<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span>other-window <span style="color: #c678dd;">(</span>- n<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
被执行，否则<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span>other-window -1<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
被执行。<br />
</p>

<p>
还有另一个符号，t，代表truth， 但是这没有nil重要，就像后面表明的。<br />
</p></li>
<li>它和空表很难区分。在Lisp解释器中，符号nil和空表()是相同的对象。如果你调用listp来判断符号nil是否是一个表，你将会得到结果t，也就是truth。同样的，如果你使用symbolp来判断空表是否是一个符号，那么也会得到t。但是，如果你传递任何其他列表给symbolp，或者传递其他符号给listp，那么你会得到nil&#x2013;即表示非。<br /></li>
<li><p>
它的值就是它自身。当你计算符号nil时，结果是nil。因此，不像其他的符号，当你需要它的名称而不是它的值得时候，nil不需要引用，因为它的名称就是它的值。所以你可以这样写：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> x nil<span style="color: #51afef;">)</span> <span style="color: #5B6268;">; </span><span style="color: #5B6268;">&#23558;nil&#36171;&#32473;&#21464;&#37327;x</span>
</pre>
</div>

<p>
将nil赋给变量x而不必这样写：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">&#8232;&#8232;<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> x 'nil<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
虽然这两种写法都可以。同样的，不要试图将任何新的值赋给nil，[<a href="#org3f70b88">12</a>]虽然它看起来是一个合法的变量名称。<br />
</p></li>
</ol>

<p>
nil的另一个功能就是区分列表是否正确。这将在<a href="./6.html">第六章</a>中讨论。<br />
</p>

<p>
另一个符号t用来表示正确。就像nil，t也表示着自身的值，因此不需要引用。与nil不同的是，t并没有跟其他什么对象相同。也与nil不同的是，nil是唯一表示错误的方式，而其他所有Lisp值都和t一样表示正确。但是，当你仅仅想表示正确时（就像symbolp的返回值）你不需要选择一个类似17或者“plugin”这样的值来表示它。<br />
</p>
</div>
</div>

<div id="outline-container-orgc956d88" class="outline-3">
<h3 id="orgc956d88"><span class="section-number-3">2.4</span> 简化代码</h3>
<div class="outline-text-3" id="text-2-4">
<p>
就像前面提到的，表达式<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> n                                   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">&#22914;&#26524;...</span>
    <span style="color: #c678dd;">(</span>other-window <span style="color: #98be65;">(</span>- n<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>                <span style="color: #5B6268;">; </span><span style="color: #5B6268;">...&#37027;&#20040;</span>
  <span style="color: #c678dd;">(</span>other-window -1<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>                    <span style="color: #5B6268;">; </span><span style="color: #5B6268;">...&#21542;&#21017;</span>
</pre>
</div>

<p>
是Lisp版本的if-then-else结构。if的第一个参数是一个条件。它将被检测结果是真（除nil之外的一切值）还是假（nil）。如果为真，则第二个参数&#x2013;“then”分句将会被执行。如果是假，第三个参数&#x2013;“else”分句（可选的）&#x2013;将会被执行。if的返回值总是最后执行的表达式的结果。<a href="./B.html">附录B</a>会向你展示if和其他像cond和while这样的Lisp流程控制函数。<br />
</p>

<p>
在本例中，我们可以通过提取公有表达式的方式来进行简化。注意到other-window在if的两个分支中都被调用了。唯一的区别来自传递给other-window的参数n。因此我们可以将表达式重写：<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span>other-window <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> n <span style="color: #98be65;">(</span>- n<span style="color: #98be65;">)</span> -1<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
通常，<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> test
    <span style="color: #c678dd;">(</span>a b<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>a c<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
可以简写成(a (if test b c))。<br />
</p>

<p>
我们还观察到在if的两个分支上，我们都在取反&#x2013;不管是n的负数还是1的负数。所以<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> n <span style="color: #c678dd;">(</span>-n<span style="color: #c678dd;">)</span> -1<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
可以变为<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>- <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> n n 1<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a77f85" class="outline-3">
<h3 id="org9a77f85"><span class="section-number-3">2.5</span> 逻辑表达式</h3>
<div class="outline-text-3" id="text-2-5">
<p>
另一个Lisp程序员的常用技巧甚至可以使这个表达式更简单：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> n n 1<span style="color: #51afef;">)</span> = <span style="color: #51afef;">(</span><span style="color: #51afef;">or</span> n 1<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
函数or跟大多数语言中的逻辑或都一样：如果所有条件为否，则返回否，否则返回是。但是Lisp的or还有另一个用途：它挨个计算它的参数的值直到找到第一个为真的值并返回。如果没找到，则返回nil。所以or的返回值并不仅仅是false或者true，它返回false或者表中的第一个为true的值。这意味着通常来说，<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> a a b<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
可以替换为<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">or</span> a b<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
实际上，通常我们都应该这么写，因为如果a是true，那么(if a a b)会执行两次a而(or a b)只执行一次。（另一方面，如果你就是想a执行两次，那么当然你应该使用if）。实际上，<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> a a <span style="color: #5B6268;">; </span><span style="color: #5B6268;">&#22914;&#26524;a&#20026;true&#65292;&#36820;&#22238;a</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> b b <span style="color: #5B6268;">; </span><span style="color: #5B6268;">else if b&#20026;true&#65292;&#36820;&#22238;b</span>
    ...
    <span style="color: #98be65;">(</span><span style="color: #51afef;">if</span> y y z<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #5B6268;">; </span><span style="color: #5B6268;">else if y&#20026;true&#65292;&#36820;&#22238;y&#65292;&#21542;&#21017;z</span>
</pre>
</div>

<p>
（虽然这看上去很夸张但在真正的程序里这是很常见的一种模式）可以转换成下面这种形式。<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">or</span> a b .. y z<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
同样的，<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> a
    <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> b
        ...
      <span style="color: #98be65;">(</span><span style="color: #51afef;">if</span> y z<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
（注意这个例子中没有任何else）可以被写成<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> a b ... y z<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
因为and通过计算每个参数直到遇到一个值为nil的参数。如果找到了，就返回nil，否则它返回最后一个参数的值。<br />
</p>

<p>
另一个简写需要注意：一些程序员喜欢将<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span><span style="color: #51afef;">and</span> a b ... y<span style="color: #c678dd;">)</span> z<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
转换成<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> a b ... y z<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
我不这么做，因为虽然他们功能上相同，但是前一个有一个细微的暗示&#x2013;即“如果a-y都是true的话就执行z”&#x2013;后一种却不是这样，这可以让人更加容易理解代码。<br />
</p>
</div>
</div>
