2.org
** 最好的other-window-backward
回到other-window-backward。使用我们自己整理过的other-window调用，现在函数的定义看起来是这样的：
#+BEGIN_SRC emacs-lisp
  (defun other-window-backward (&optional n)
    "Select Nth previous window."
    (interactive "p")
    (other-window (- (or n 1))))
#+END_SRC

但是最好的定义--最有Emacs Lisp风格的--应该是这样：
#+BEGIN_SRC emacs-lisp
  (defun other-window-backward (&optional n)
    "Select Nth previous window."
    (interactive "P")
    (other-window (- (prefix-numeric-value n))))
#+END_SRC

在这个版本中，交互声明中的字母并不是小写的p了，而是大写的P；而other-window的参数变成了(- (prefix-numeric-value n))，而不是(- (or n 1))。

大写的P表示“当以交互的方式调用时，将前置参数保持为原始形式（raw form）并将其赋值给n”。前置参数的原始形式是Emacs使用的一种内部数据结构，用于在触发命令之前记录用户提供的前置信息。（查看[[补充：原始的前置参数][补充：原始的前置参数]]得到更多关于原始前置参数数据结构的细节。）函数prefix-numeric-value可以将像(interactive "p")那样将数据结构转换为一个数字。而且，如果other-window-backward以非交互的方式调用（因此n就不再是一个原始形式的前置参数），prefix-numeric-value还是会做正确的事情--也就是说，如果n是数字则直接返回n，如果n为nil则返回1。

可以说，这个定义并不比我们前面定义的other-window-backward的功能更强大。但是这个版本更“Emacs-Lisp-like”，因为它的代码重用性更好。它使用内建的函数prefix-numeric-value而不是重复定义函数的行为。

现在，让我们看看另一个例子。

* 逐行滚动
在我使用Emacs之前，我习惯了一些编辑器上存在而Emacs上并没有的特性。自然我很怀念这些功能并且决定找回他们。这其中的一个例子是使用一个键来向上、向下滚屏。

Emacs有两个滚屏方法，scroll-up和scroll-down，分别绑定到C-v和M-v。每个方法都有一个可选参数来告诉它要滚动多少行。默认的，他们每次翻一屏。（不要把向上、向下滚屏和通过C-n/C-p向上、向下移动光标混淆。）

虽然我可以使用C-u 1 C-v和C-u 1 M-v来每次向上、向下滚动一行，我还是希望只使用一次按键就实现这一功能。使用前面章节所讲述的技术，这很容易实现。

虽然在这之前，我还是要先考虑一件事。我永远也分不清这两个函数实际上分别是干什么的。scroll-up是不是将文本向上移动，展示出下面的一部分文件？或者它表示展示上面的一部分文件，而把所有文字下移？我希望这些方法的名称能够少一些混淆，就像scroll-ahead和scrll-behind。

我们可以使用defalias来指向任意Lisp函数。
#+BEGIN_SRC elisp
  (defalias 'scroll-ahead 'scroll-up)
  (defalias 'scroll-behind 'scroll-down)
#+END_SRC

这样就好多了。现在我们就再也不用为这些混淆的名字而头痛了（虽然原来的名字仍然还在）。

现在我们来定义两个函数来使用正确的参数调用scroll-ahead和scroll-behind。这个过程和之前定义other-window-backward一样：
#+BEGIN_SRC elisp
  (defun scroll-one-line-ahead ()
    "Scroll ahead one line."
    (interactive)
    (scroll-ahead 1))

  (defun scroll-one-line-behind ()
    "Scroll behind one line."
    (interactive)
    (scroll-behind 1))
#+END_SRC

同样，我们可以给他们一个可选参数来使函数更通用：
#+BEGIN_SRC elisp
  (defun scroll-n-lines-ahead (&optional n)
    "Scroll ahead N lines (1 by default)."
    (interactive "P")
    (scroll-ahead (prefix-numeric-value n)))
   
  (defun scroll-n-lines-behind (&optional n)
    "Scroll behind N lines (1 by default)."
    (interactive "P"))
#+END_SRC

最后，我们需要选择按键来绑定新的命令。我喜欢C-q绑定scroll-n-lines-behind而C-z绑定scroll-n-lines-ahead：
#+BEGIN_SRC elisp
  (global-set-key "\C-q" 'scroll-n-lines-behind)
  (global-set-key "\C-z" 'scroll-n-lines-ahead)
#+END_SRC

默认的，C-q绑定到了quoted-insert。我将这条不常用的函数移动到了C-x C-q：
#+BEGIN_SRC elisp
  (global-set-key "\C-x\C-q" 'quoted-insert)
#+END_SRC

C-x C-q的默认绑定是vc-toggle-read-only，我并不关心它的丢失。

C-z的在X系统下默认绑定是iconify-or-deiconify-frame，在终端的绑定是suspend-emacs。在这两种情况下，函数也绑定到了C-x C-z，所以也没有必要重新绑定他们。

* 其他光标和文本移动命令
下面是另外一些绑定到合理键位的简单命令。
#+BEGIN_SRC emacs-lisp
  (defun point-to-top ()
    "Put point on top line of window."
    (interactive)
    (move-to-window-line 0))

  (global-set-key "\M-," 'point-to-top)
#+END_SRC

"Point"指代光标的位置。这个命令将光标移动到窗口的左上角。推荐的按键绑定替换了tags-loop-continue，我把它替换到了C-x,:

#+BEGIN_SRC elisp
  (global-set-key "\C-x," 'tags-loop-continue)
#+END_SRC

下一个函数将光标移动到了窗口的左下角。
#+BEGIN_SRC elisp
  (defun point-to-bottom ()
    "Put point at beginning of last visible line."
    (interactive)
    (move-to-window-line -1))

  (global-set-key "\M-." 'point-to-bottom)
#+END_SRC

这次的按键绑定替换了find-tag。我将它放到了C-x.，这回替换了我并不关心的set-fill-prefix。
#+BEGIN_SRC elisp
  (defun line-to-top ()
    "Move current line to top of window."
    (interactive)
    (recenter 0))

  (global-set-key "\M-!" 'line-to-top)
#+END_SRC

这条命令将光标所在的行移动到屏幕的最顶端。这条命令替换了shell-command。

改变Emacs的按键绑定有一个缺点。当你习惯了自己高度定制化的Emacs后再在另一个没有这些定制的Emacs上工作时（例如在不同的电脑上或者使用了朋友的账号登录），你会很不习惯。这经常困扰着我。我训练着自己在未定制的Emacs上工作而不会受太多影响。我很少使用未定制的Emacs，所以总的来说得大于失。当你疯狂的更改按键绑定之前，你需要权衡一下这些得失。

* 处理符号链接
目前为止，我们写的函数都非常简单。本质上，他们都只是重新排列了一下参数来调用其他已经存在的函数。现在让我们看看需要我们更多编程工作的示例。

在UNIX里，符号链接（symbol link，或者symlink）是一个指向另一个文件的文件。当你查看符号链接的内容时，你实际上得到的是它所指向的文件的内容。

假设你在Emacs里访问了一个指向其他文件的符号链接。你修改了一下文件内容然后按下C-x C-s来保存buffer。Emacs应该做什么呢？

1. 使用编辑的文件替换符号链接，破坏链接，所指向的原始文件保持不变。
2. 覆盖符号链接所指向的文件。
3. 提示用户来选择上面的方案。
4. 其他。

不同的编辑器处理符号链接的方式都不一样，所以习惯一个编辑器的用户可能会对其他编辑器的行为感到不适应。而且，我相信情况不同正确的处理方式也不同，而用户每次遇到这种情况都被迫需要考虑一下。

我的做法是：当我访问一个符号链接文件时，我让Emacs自动的将buffer变为只读。当我想要修改时会导致一个“Buffer is read-only”的错误。这个错误提示我可能正在访问一个符号链接。然后我会选择使用我自己设计的两个特殊命令之一来处理。

