html/2.html

<div id="outline-container-org5f6e245" class="outline-3">
<h3 id="org5f6e245"><span class="section-number-3">5.1</span> 钩子</h3>
<div class="outline-text-3" id="text-5-1">
<p>
当我希望Emacs在我访问某个文件时将其对应的buffer变为只读，我必须告诉Emacs“当我访问这个文件时执行一段特定的Lisp代码”。访问文件的动作应该触发一段我写的代码。这时钩子（hooks）就出场了。<br />
</p>

<p>
钩子是指在特定情况下执行的指向某个函数列表的Lisp变量。例如，变量write-file-hooks是当一个buffer保存时Emacs执行的函数列表，而post-command-hook是当执行一个交互命令时执行的函数列表。在本例中我们最感兴趣的钩子是find-file-hooks，这在当Emacs访问一个新文件时会被执行。（有许多钩子，有一些我们将会在后面的内容中看到。要查看所有钩子，可以使用M-x apropos RET hook RET。）<br />
</p>

<p>
函数add-hook将一个函数添加到钩子变量上。下面的函数将被添加到find-file-hooks：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">read-only-if-symlink</span> <span style="color: #c678dd;">()</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>file-symlink-p buffer-file-name<span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span><span style="color: #51afef;">progn</span>
        <span style="color: #da8548;">(</span><span style="color: #51afef;">setq</span> buffer-read-only t<span style="color: #da8548;">)</span>
        <span style="color: #da8548;">(</span>message <span style="color: #98be65;">"File is a symlink"</span><span style="color: #da8548;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
这个函数用来检测当前buffer的文件是否是符号链接。如果是，则buffer将变为只读并且显示“File is a symlink”。让我们仔细看一下这个函数。<br />
</p>

<ul class="org-ul">
<li>首先，注意参数列表是空的。钩子变量中的函数都没有参数。<br /></li>
<li>函数file-symlink-p用来检测它的参数，也就是buffer的文件名称是否是一个符号链接。它是一个断言（predicate），这表示它会返回true或者false。在Lisp中，断言通常被以p或者-p结尾。<br /></li>
<li>file-symlink-p的参数是buffer-file-name。这个预置的变量在每个buffer中都有不同的值，因此也称为buffer局部变量。它总是保存着当前buffer的名字。在这里，当前buffer是指find-file-hooks执行时找到的文件。<br /></li>
<li><p>
如果buffer-file-name指向的是符号链接，我们希望做两件事：将buffer变为只读，并且提示一条信息。但是，Lisp在if-then-else中的“then”部分只允许一条表达式。如果我们写成：  <br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>file-symlink-p buffer-file-name<span style="color: #c678dd;">)</span>
    <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> buffer-read-only t<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>message <span style="color: #98be65;">"File is a symlink"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
这表示，“如果buffer-file-name是符号链接，那么就把buffer变成只读的，否则打印信息‘File is a symlink.’”要想两条语句都执行，我们可以把他们放到progn里，就像下面这样： <br />
</p>
<div class="org-src-container">
<pre class="src src-elisp">&#8232;<span style="color: #51afef;">(</span><span style="color: #51afef;">progn</span>
   <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> buffer-read-only t<span style="color: #c678dd;">)</span>
   <span style="color: #c678dd;">(</span>message <span style="color: #98be65;">"File is a symlink"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
progn表达式会顺序执行内部的表达式并且返回最后执行的语句的值。<br />
</p></li>
<li>变量buffer-read-only也是buffer局部变量，用于控制当前buffer是否是只读的。<br /></li>
</ul>

<p>
既然我们已经定义了read-only-if-symlink，我们就可以调用<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span>add-hook 'find-file-hooks 'read-only-if-symlink<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
来将其添加到访问新文件就会触发的函数列表中。<br />
</p>
</div>
</div>

<div id="outline-container-org387c131" class="outline-3">
<h3 id="org387c131"><span class="section-number-3">5.2</span> 匿名函数</h3>
<div class="outline-text-3" id="text-5-2">
<p>
当你使用defun定义函数的时候，你给了函数一个可以在任何地方调用的名字。但是对于那些并不需要在任何地方都被调用的函数呢？假如它只需要在一个地方生效呢？可以说，read-only-if-symlink仅需要在find-file-hooks的列表里执行；实际上，在find-file-hooks之外的地方调用它甚至并不是什么好事。<br />
</p>

<p>
我们可以在不指定名称的情况下定义函数。这种函数被称为匿名函数。我们使用Lisp的关键词lambda[<a href="#org8f77b8d">13</a>]来定义，除了不指定函数名外，它的作用跟defun一模一样。<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">lambda</span> <span style="color: #c678dd;">()</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>file-symlink-p buffer-file-name<span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span><span style="color: #51afef;">progn</span>
        <span style="color: #da8548;">(</span><span style="color: #51afef;">setq</span> buffer-readonly t<span style="color: #da8548;">)</span>
        <span style="color: #da8548;">(</span>message &#8220;File is a symlink<span style="color: #da8548;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
lambda后面的空括号是匿名函数的参数列表。这个函数没有参数。匿名函数可以用在任何你使用函数名的地方：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span>add-hook 'find-file-hooks
          '<span style="color: #c678dd;">(</span>lambda <span style="color: #98be65;">()</span>
             <span style="color: #98be65;">(</span><span style="color: #51afef;">if</span> <span style="color: #da8548;">(</span>file-symlink-p buffer-file-name<span style="color: #da8548;">)</span>
                 <span style="color: #da8548;">(</span><span style="color: #51afef;">progn</span>
                   <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">setq</span> buffer-read-only t<span style="color: #a9a1e1;">)</span>
                   <span style="color: #a9a1e1;">(</span>message <span style="color: #98be65;">"File is a symlink"</span><span style="color: #a9a1e1;">)</span><span style="color: #da8548;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
这样就只有add-hook可以访问它了。[<a href="#orgac2e93a">14</a>]<br />
</p>

<p>
不过也有一个不应该在钩子中使用匿名函数的原因。如果你想要从钩子中移除一个函数的话，你需要使用函数名来调用remove-hook，就像这样：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span>remove-hook 'find-file-hooks 'read-only-if-symlink<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
而如果使用匿名函数就没法这样做了。<br />
</p>
</div>
</div>
