2.org
** 处理符号链接
当Emacs提醒我在编辑符号链接时，我可能希望打开链接的目标文件来作为当前buffer的内容；我也可能希望"clobber"符号链接（将符号链接文件替换为所指向的真实文件）然后再访问它。下面是这两个的实现方式：
#+BEGIN_SRC elisp
  (defun visit-target-instead ()
    "Replace this buffer with a buffer visiting the link target."
    (interactive)
    (if buffer-file-name
        (let ((target (file-symlink-p buffer-file-name)))
          (if target
              (find-alternate-file target)
            (error "Not visiting a symlink")))
      (error "Not visiting a file")))

  (defun clobber-symlink ()
    "Replace symlink with a copy of the file."
    (interactive)
    (if buffer-file-name
        (let ((target (file-symlink-p buffer-file-name)))
          (if target
              (if (yes-or-no-p (format "Replace %s with %s?"
                                       buffer-file-name
                                       target))
                  (progn
                    (delete-file buffer-file-name)
                    (write-file buffer-file-name)))
            (error "Not visiting a symlink")))
      (error "Not visiting a file")))
#+END_SRC

两个函数都以下面的表达式开始：
#+BEGIN_SRC elisp
  (if buffer-file-name
      ...
    (error “Not visiting a file”))
#+END_SRC

（我将其他内容省略掉以强调这个if结构。）因为buffer-file-name可能为空（当前buffer可能没有访问任何文件--例如，*scratch* buffer），所以这是必要的，而传递nil给file-symlink-p将会触发错误，“Wrong type argument: stringp,nil”。[[[2-15][15]]]这个错误表示一个函数的参数应该是字符串--一个符合stringp断言的对象--但是却得到了nil。visit-target-instead和clobber-symlink都会触发这个错误信息，所以我们自己来检测buffer-file-name是不是nil。如果是nil，那么“else”子句里我们会使用error函数生成一个可读性更好的错误信息--“Not visiting a file”。当error函数被调用时，当前的命令会被终止，Emacs将会返回到它的最顶层来等待用户的下一个输入。

为什么read-only-if-symlink中不需要检测buffer-file-name是否为空呢？因为这个方法只会由find-file-hooks调用，而这个钩子只有当访问某个文件时才会触发。

在buffer-file-name条件的“then”部分，两个函数都有下面的结构
#+BEGIN_SRC elisp
  (let ((target (file-symlink-p buffer-file-name))) ...)
#+END_SRC

大多数语言都有方法来创建临时变量（也称为局部变量），它们只存在于某个特定的代码域中，称为变量的作用域。在Lisp中，临时变量使用let来创建，结构是这样的：

#+BEGIN_SRC elisp
  (let ((var1 value1)
        (var2 value2)
        ...
        (varn valuen))
    body1 body2 ... bodyn)
#+END_SRC

这会将value1赋值给var1，value2赋值给var2，依此类推；var1和var2只能在bodyi表达式中使用。此外，使用临时变量能够帮助避免不同域的代码中出现函数名相同的冲突。

所以表达式
#+BEGIN_SRC elisp
  (let ((target (file-symlink-p buffer-file-name))) ...)
#+END_SRC

创建了一个名为target的临时变量，它的值是(file-symlink-p buffer-file-name)的返回值。

就像前面提到的，file-symlink-p是一个断言，也就是说它的返回值是真或者假。但是因为真在Lisp中可以被任何除nil之外的值表示，如果file-symlink-p的参数是一个符号链接时它的返回值并不一定就是t。实际上，它会返回符号链接所指向的文件名。所以如果buffer-file-name是符号链接的名字，target将会是符号链接的目标的名称。

在临时变量target的作用域中，let的body都是这样的：
#+BEGIN_SRC elisp
  (if target
      ...
    (error “Not visiting a symlink”))
#+END_SRC

在执行完let的body之后，变量target就不存在了。

在let中，如果target为空（file-symlink-p可能会返回nil，因为buffer-file-name可能并不是一个符号链接），那么我们就会在“else”里产生一个错误信息，“Not visiting a symlink”。否则每个函数中会执行自己的逻辑。最后我们来看两个函数不一样的地方。

函数visit-target-instead中执行
#+BEGIN_SRC elisp
  (find-alternate-file target)
#+END_SRC

这会访问target文件来替换当前的buffer，并且会提示用户，以免原buffer还有未保存的修改。它甚至会触发find-file-hooks，因为新文件也可能是一个符号链接！

在visit-target-instead调用find-alternate-file的地方，clobber-symlink则如下所示：
#+BEGIN_SRC elisp
  (if (yes-or-no-p ...) ...)
#+END_SRC

函数yes-or-no-p会询问用户一个问题，并会根据用户的选择返回true或false。本例中，问题是：
#+BEGIN_SRC elisp
  (format "Replace %s with %s?"
          buffer-file-name
          target)
#+END_SRC

这个字符串的结构和C语言的printf很相似。第一个参数是一个格式化模式字符串。每个%s都使用后面的字符串参数来替换。第一个%s使用buffer-file-name的值替换，第二个使用target的值替换。所以如果buffer-file-name的值是“foo”而target的值是“bar”，那么提示就会是“Replace foo with bar?”（format函数还支持其他的格式化符号。例如，如果参数是ASCII值则%c会打印出一个字母。使用M-? f format RET来查看整个功能列表。）

在检查了yes-or-no-p的返回值并且用户选择了“yes”之后，clobber-symlink将会执行：
#+BEGIN_SRC elisp
  (progn
    (delete-file buffer-file-name)
    (write-file buffer-file-name))
#+END_SRC

我们已经知道，progn会把多条Lisp表达式组合起来。delete-file会删除文件（只是个符号链接），write-file会将当前buffer的内容保存到buffer-file-name所指向的位置，只是这次保存的是普通文件。

我喜欢将C-x t绑定到visit-target-instead（默认未被使用）而C-x 1绑定到clobber-symlink（默认绑定到count-linespage）。

