html/2.html

<div id="outline-container-org61658d5" class="outline-3">
<h3 id="org61658d5"><span class="section-number-3">5.3</span> 处理符号链接</h3>
<div class="outline-text-3" id="text-5-3">
<p>
当Emacs提醒我在编辑符号链接时，我可能希望打开链接的目标文件来作为当前buffer的内容；我也可能希望"clobber"符号链接（将符号链接文件替换为所指向的真实文件）然后再访问它。下面是这两个的实现方式：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">visit-target-instead</span> <span style="color: #c678dd;">()</span>
  <span style="color: #83898d;">"Replace this buffer with a buffer visiting the link target."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> buffer-file-name
      <span style="color: #98be65;">(</span><span style="color: #51afef;">let</span> <span style="color: #da8548;">(</span><span style="color: #a9a1e1;">(</span>target <span style="color: #ECBE7B;">(</span>file-symlink-p buffer-file-name<span style="color: #ECBE7B;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #da8548;">)</span>
        <span style="color: #da8548;">(</span><span style="color: #51afef;">if</span> target
            <span style="color: #a9a1e1;">(</span>find-alternate-file target<span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #ECBE7B;">error</span> <span style="color: #98be65;">"Not visiting a symlink"</span><span style="color: #a9a1e1;">)</span><span style="color: #da8548;">)</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #ECBE7B;">error</span> <span style="color: #98be65;">"Not visiting a file"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">clobber-symlink</span> <span style="color: #c678dd;">()</span>
  <span style="color: #83898d;">"Replace symlink with a copy of the file."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> buffer-file-name
      <span style="color: #98be65;">(</span><span style="color: #51afef;">let</span> <span style="color: #da8548;">(</span><span style="color: #a9a1e1;">(</span>target <span style="color: #ECBE7B;">(</span>file-symlink-p buffer-file-name<span style="color: #ECBE7B;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #da8548;">)</span>
        <span style="color: #da8548;">(</span><span style="color: #51afef;">if</span> target
            <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">if</span> <span style="color: #ECBE7B;">(</span>yes-or-no-p <span style="color: #4db5bd;">(</span>format <span style="color: #98be65;">"Replace %s with %s?"</span>
                                     buffer-file-name
                                     target<span style="color: #4db5bd;">)</span><span style="color: #ECBE7B;">)</span>
                <span style="color: #ECBE7B;">(</span><span style="color: #51afef;">progn</span>
                  <span style="color: #4db5bd;">(</span>delete-file buffer-file-name<span style="color: #4db5bd;">)</span>
                  <span style="color: #4db5bd;">(</span>write-file buffer-file-name<span style="color: #4db5bd;">)</span><span style="color: #ECBE7B;">)</span><span style="color: #a9a1e1;">)</span>
          <span style="color: #a9a1e1;">(</span><span style="color: #ECBE7B;">error</span> <span style="color: #98be65;">"Not visiting a symlink"</span><span style="color: #a9a1e1;">)</span><span style="color: #da8548;">)</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #ECBE7B;">error</span> <span style="color: #98be65;">"Not visiting a file"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
两个函数都以下面的表达式开始：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> buffer-file-name
    ...
  <span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">error</span> &#8220;Not visiting a file&#8221;<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
（我将其他内容省略掉以强调这个if结构。）因为buffer-file-name可能为空（当前buffer可能没有访问任何文件&#x2013;例如，*scratch* buffer），所以这是必要的，而传递nil给file-symlink-p将会触发错误，“Wrong type argument: stringp,nil”。[<a href="#orgf389fa9">15</a>]这个错误表示一个函数的参数应该是字符串&#x2013;一个符合stringp断言的对象&#x2013;但是却得到了nil。visit-target-instead和clobber-symlink都会触发这个错误信息，所以我们自己来检测buffer-file-name是不是nil。如果是nil，那么“else”子句里我们会使用error函数生成一个可读性更好的错误信息&#x2013;“Not visiting a file”。当error函数被调用时，当前的命令会被终止，Emacs将会返回到它的最顶层来等待用户的下一个输入。<br />
</p>

<p>
为什么read-only-if-symlink中不需要检测buffer-file-name是否为空呢？因为这个方法只会由find-file-hooks调用，而这个钩子只有当访问某个文件时才会触发。<br />
</p>

<p>
在buffer-file-name条件的“then”部分，两个函数都有下面的结构<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>target <span style="color: #da8548;">(</span>file-symlink-p buffer-file-name<span style="color: #da8548;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span> ...<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
大多数语言都有方法来创建临时变量（也称为局部变量），它们只存在于某个特定的代码域中，称为变量的作用域。在Lisp中，临时变量使用let来创建，结构是这样的：<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>var1 value1<span style="color: #98be65;">)</span>
      <span style="color: #98be65;">(</span>var2 value2<span style="color: #98be65;">)</span>
      ...
      <span style="color: #98be65;">(</span>varn valuen<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  body1 body2 ... bodyn<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
这会将value1赋值给var1，value2赋值给var2，依此类推；var1和var2只能在bodyi表达式中使用。此外，使用临时变量能够帮助避免不同域的代码中出现函数名相同的冲突。<br />
</p>

<p>
所以表达式<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>target <span style="color: #da8548;">(</span>file-symlink-p buffer-file-name<span style="color: #da8548;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span> ...<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
创建了一个名为target的临时变量，它的值是(file-symlink-p buffer-file-name)的返回值。<br />
</p>

<p>
就像前面提到的，file-symlink-p是一个断言，也就是说它的返回值是真或者假。但是因为真在Lisp中可以被任何除nil之外的值表示，如果file-symlink-p的参数是一个符号链接时它的返回值并不一定就是t。实际上，它会返回符号链接所指向的文件名。所以如果buffer-file-name是符号链接的名字，target将会是符号链接的目标的名称。<br />
</p>

<p>
在临时变量target的作用域中，let的body都是这样的：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> target
    ...
  <span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">error</span> &#8220;Not visiting a symlink&#8221;<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
在执行完let的body之后，变量target就不存在了。<br />
</p>

<p>
在let中，如果target为空（file-symlink-p可能会返回nil，因为buffer-file-name可能并不是一个符号链接），那么我们就会在“else”里产生一个错误信息，“Not visiting a symlink”。否则每个函数中会执行自己的逻辑。最后我们来看两个函数不一样的地方。<br />
</p>

<p>
函数visit-target-instead中执行<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span>find-alternate-file target<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
这会访问target文件来替换当前的buffer，并且会提示用户，以免原buffer还有未保存的修改。它甚至会触发find-file-hooks，因为新文件也可能是一个符号链接！<br />
</p>

<p>
在visit-target-instead调用find-alternate-file的地方，clobber-symlink则如下所示：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>yes-or-no-p ...<span style="color: #c678dd;">)</span> ...<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
函数yes-or-no-p会询问用户一个问题，并会根据用户的选择返回true或false。本例中，问题是：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span>format <span style="color: #98be65;">"Replace %s with %s?"</span>
        buffer-file-name
        target<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
这个字符串的结构和C语言的printf很相似。第一个参数是一个格式化模式字符串。每个%s都使用后面的字符串参数来替换。第一个%s使用buffer-file-name的值替换，第二个使用target的值替换。所以如果buffer-file-name的值是“foo”而target的值是“bar”，那么提示就会是“Replace foo with bar?”（format函数还支持其他的格式化符号。例如，如果参数是ASCII值则%c会打印出一个字母。使用M-? f format RET来查看整个功能列表。）<br />
</p>

<p>
在检查了yes-or-no-p的返回值并且用户选择了“yes”之后，clobber-symlink将会执行：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">progn</span>
  <span style="color: #c678dd;">(</span>delete-file buffer-file-name<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>write-file buffer-file-name<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
我们已经知道，progn会把多条Lisp表达式组合起来。delete-file会删除文件（只是个符号链接），write-file会将当前buffer的内容保存到buffer-file-name所指向的位置，只是这次保存的是普通文件。<br />
</p>

<p>
我喜欢将C-x t绑定到visit-target-instead（默认未被使用）而C-x 1绑定到clobber-symlink（默认绑定到count-linespage）。<br />
</p>
</div>
</div>
</div>
