2.org
* 修饰Buffer切换
让我们以一个例子总结本章，这个例子将会引入一个称为修饰（advice）的非常有用的Lisp工具。

我发现我经常同时编辑许多名称相似的文件；例如，foobar.c和foobar.h。当我想从一个buffer切换到另一个时，我使用C-x b，也就是switch-to-buffer，它会询问我buffer的名称。因为我希望尽量少的按键，我使用TAB来补全buffer名称。我会输入
#+BEGIN_SRC elisp
  C-x b fo TAB
#+END_SRC

并且希望TAB会将“fo”补全为”foobar.c”，然后我只要按下RET就可以了。90%的情况下这工作的很好。另外的情况下，就像这个例子中，按下fo TAB将只会补全为“foobar.”，而让我自己区分是选择”foobar.c”还是”foobar.h”。出于习惯，我常常按下RET，结果buffer的名称变成了”foobar.”。

这时，Emacs将会创建一个新的名为foobar.的新buffer，当然这完全不是我想要的。现在我需要杀掉这个新buffer（使用C-x k，kill-buffer）然后再来一次。虽然我有时也需要新建一个不存在的buffer，但是这和刚刚这种错误的情况相比很少见。我希望在这种情况中，Emacs能够在我 出错之前提示我。

要达到这点，我们可以使用advice。advice是指一段在函数调用之前或之后执行的代码。前置修饰可以在参数传递给函数之前对其进行修改。后置修饰可以修改函数的返回值。修饰跟钩子变量有点像，只是Emacs只为一些特定的情况定义了不多的一些钩子，而你却能选择对哪些方法进行修饰。

下面是修饰的第一次尝试：
#+BEGIN_SRC elisp
  (defadvice switch-to-buffer (before existing-buffer
                                      activate compile)
    "When interactive, switch to existing buffers only."
    (interactive "b"))
#+END_SRC

让我们仔细看看它。函数defadvice用于创建一个新的修饰。它的第一个参数是要被修饰的函数名（不必引用，unquoted）--在本例中也就是switch-to-buffer。后面跟着的是特定格式的列表。它的第一个元素--在本例中也就是before--告诉我们这是前置还是后置修饰。（还有一种修饰，称为“around”，它能让你在修饰函数的内部调用被修饰的方法。）后面跟着的是这个修饰的名称；本例中是existing-buffer。以后如果你想删除或者修改这个修饰你可以使用这个名称。再后面是一些关键词：activate表示这个修饰在其定义之后马上生效（可以只是定义修饰而不生效）；compile表示这个修饰的代码应该被“byte-compiled”提高执行速度（查看[[file:./5.org][第五章]]）。

在特定格式的列表之后，跟着一个可选的文档字符串。

本例中的body只有一行交互声明，这会替换switch-to-buffer的交互声明。switch-to-buffer接受任何字符串作为buffer-name参数，而交互声明中的字符b表示“只接受已存在的buffer的名称”。我们在不影响任何以非交互形式调用switch-to-buffer的情况下做出了这个更改。所以这个修饰高效的完成了整件工作：它使switch-to-buffer只接受已存在的buffer名。

不幸的是，这样约束性太大了。还是应该能够切换到不存在的buffer，但是只在某些特殊的条件下才移除这个限制--例如，当使用前置参数的时候。这样，C-x b将会拒绝切换到不存在的buffer，而C-u C-x b将允许。

我们可以这么做：
#+BEGIN_SRC elisp
  (defadvice switch-to-buffer (before existing-buffer
                                      activate compile)
    "When interactive, switch to existing buffers only,
          unless given a prefix argument."
    (interactive
     (list (read-buffer "Switch to buffer:"
                        (other-buffer)
                        (null current-prefix-arg)))))
#+END_SRC

又一次，我们使用了前置修饰修改了switch-to-buffer的交互声明。但是这次，我们使用了一种未见过的形式调用interactive：我们传递了一个列表作为参数给它，而不是一个字母组成的字符串。

当interactive的参数不是字符串而是一些表达式时，这些表达式会进行运算得到一个参数列表传递给函数。所以在这个例子中我们调用了list，它使用下面这段表达式的返回值构建：
#+BEGIN_SRC elisp
  (read-buffer "Switch to buffer: "
               (other-buffer)
               (null current-prefix-arg))
#+END_SRC

函数read-buffer是一个底层的用于向用户询问buffer名称的函数。说它底层是因为所有其他询问buffer名称的函数最终调用的都是它。它的调用需要一个提示字符串和两个可选参数：一个默认切换到的buffer，以及一个布尔值用于标识输入是否只能是已存在的buffer。

默认的buffer，我们传递了(other-buffer)的返回值给它，它的作用是产生一个可用的默认buffer。（通常它会选择最近使用的但是当前不可见的buffer。）对于是否限制输入的布尔状态值，我们使用了
#+BEGIN_SRC elisp
  (null current-prefix-arg)
#+END_SRC

这会查看current-prefix-arg是否为nil。如果是，则返回t；否则返回nil。因此，如果没有前置参数（也就是current-prefix-arg为nil），那么我们调用的是
#+BEGIN_SRC elisp
  (read-buffer "Switch to buffer: "
               (other-buffer)
               t)
#+END_SRC

表示“读入buffer名称，只接受已存在的buffer”。如果有前置参数，那么我们调用的是
#+BEGIN_SRC elisp
  (read-buffer "Switch to buffer: "
		  (other-buffer)
                  nil)
#+END_SRC

表示“读入buffer名称而不做任何限制”（允许不存在的buffer作为参数）。然后read-buffer的返回值被传给了list，list（包含着一个元素，也就是buffer名称）传递给switch-to-buffer作为参数列表。

switch-to-buffer这样修饰之后，Emacs将不会回应我切换到不存在的buffer的要求了，除非我按下C-u来要求这种能力。

完整起见，你还应该同样修饰函数switch-to-buffer-other-window和switch-to-buffer-other-frame。

* 补充：原始的前置参数
变量current-prefix-arg总是保存着最后的“原始”前置参数，跟你从(interactive "P")中取到的一样。

函数prefix-numeric-value可以应用到一个跟你从(interactive "P")中取得的“原始”前置参数一样类型的值来得到数值。

原始的前置参数什么样子呢？表格2-1展示出了原始值以及对应的数值。
表格2-1：前置参数
| 如果用户输入                    | 原始值                   | 数值     |
| C-u后面跟一个（可能是负数）数字 | 数字本身                 | 数字本身 |
| C-u - （后面什么都没有）        | 符号-                    | -1       |
| C-u 一行中n次                   | 一个包含数字4的n次方的表 | 4的n次方 |
| 没有前置参数                    | nil                      | 1        |

<<2-8>>[8]. 如果你像[[file:/1.org][第一章]]中描述的那样修改了help-command的绑定，那么describe-key的按键绑定是M-? k；否则是C-h k。

<<2-9>>[9]. “parameter”与“argument”有什么不同呢？这两个概念通常可以替换使用，但是技术上来讲，“parameter”是指函数定义中的形参，而“argument”是指函数调用时传入的实参。argument的值会传递给parameter。

<<2-10>>[10]. 再一次，如果你已经把help-command的绑定到M-?那么就是M-? f。从这开始，我将假设你修改过了，或者你至少应该理解我的做法。

<<2-11>>[11]. 要查看interactive的code letter，按下M-? f interactive RET。

<<2-12>>[12]. 实际上Emacs也不允许你把任何值赋给nil。

<<2-13>>[13]. “lambda演算”是一套用于研究函数及其参数的数学形式。某种意义上来说它是Lisp（以及其他很多语言）的理论基础。单词“lambda”只是一个希腊语中的单词，并没有什么特殊的含义。

<<2-14>>[14]. 这并不是绝对正确的。其他的代码可以搜索find-file-hooks列表的内容并且执行里面的所有函数。这里的意思是这个函数相对于defun的显式声明来说隐藏起来了。

<<2-15>>[15]. 请自己试一下：M-: (file-symlink-p nil) RET。
